kvpear-api/test/api-testing/load-test.yaml
config:
  plugins:
    expect: {}
  target: "http://localhost:8080" # Replace with your API endpoint
  phases:
    - duration: 1
      arrivalRate: 1
  defaults:
    headers:
      x-api-key: "d8564c31f05f8ce3af28e0f0d317b64e"
      Content-Type: 'text/plain'
  processor: ./processor.js
  beforeRequest:

scenarios:
  - beforeScenario: generateVars
    name: "Test"
    flow:
      - post:
          url: "/buckets"
          body: "{{ bucket }}"
          expect:
            - statusCode: 201

      - post:
          url: "/kvs/{{ bucket }}/{{ keyName }}"
          body: "{{ value }}"
          expect:
            - statusCode: 201
            - matchesRegexp: "{{ value }}"

      - loop:
          - get:
              url: "/kvs/{{ bucket }}/{{ keyName }}"   
              expect:
                - statusCode: 200
                - matchesRegexp: "{{ value }}"
        count: 10

      - loop:
          - get:
              url: "/kvs/{{ bucket }}?prefix={{ keyNamePrefix }}"
              capture:
                - json: "$[0].value"
                  as: "responseValue"
              expect:
                - statusCode: 200
                - equals:
                  - "{{ value }}"
                  - "{{ responseValue }}"
        count: 10

      - delete:
          url: "/kvs/{{ bucket }}/{{ keyName }}"

      - delete:
          url: "/buckets/{{ bucket }}"