kvpear-api/test/api-testing/load-test.yaml
config:
  target: 'http://localhost:8080'  # Replace with your API endpoint
  phases:
    - duration: 10
      arrivalRate: 1

scenarios:
  - flow:
      - post:
          url: '/buckets'
          json:
            data: 'bucket'
        capture:
          - json: '$.id'
            as: 'bucketId'

      - post:
          url: '/kvs/{{ bucketId }}/my-key'
          json:
            data: 'your-text-value'  # Replace with your desired text value
        capture:
          - json: '$'
            as: 'postedData'
      
      - get:
          url: '/kvs/{{ bucketId }}/my-key'
        capture:
          - json: '$'
            as: 'retrievedData'
      
      - loop:
          - get:
              url: '/kvs/{{ bucketId }}/my-key'
          - expect:
              - statusCode: 200
              - json: '$.data'
                equals: '{{ postedData }}'

      - loop:
          - get:
              url: '/kvs/{{ bucketId }}?prefix=my'
          - expect:
              - statusCode: 200
              - json: '$.length'
                equals: 1
      
      - delete:
          url: '/kvs/{{ bucketId }}/my-key'
      
      - delete:
          url: '/buckets/{{ bucketId }}'